Unix/wsman/samples/Put2.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd"><s:Header><a:To>https://157.59.85.210:7779/wsman</a:To><w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/MSFT_Person</w:ResourceURI><a:ReplyTo><a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address></a:ReplyTo><a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Put</a:Action><w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize><a:MessageID>uuid:E0D1E346-8E68-4345-80E9-3D56D3F20812</a:MessageID><w:Locale xml:lang="en-US" s:mustUnderstand="false" /><p:DataLocale xml:lang="en-US" s:mustUnderstand="false" /><p:SessionId s:mustUnderstand="false">uuid:9EE6260C-C8C8-4D3E-9824-BD80D7713831</p:SessionId><p:OperationID s:mustUnderstand="false">uuid:29391A9A-58B3-4812-B355-969FC647FD62</p:OperationID><p:SequenceId s:mustUnderstand="false">1</p:SequenceId><w:SelectorSet><w:Selector Name="__cimnamespace">root/cimv2</w:Selector><w:Selector Name="Key">1</w:Selector></w:SelectorSet><w:OptionSet xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><w:Option Name="wmiarray:__MIInstanceModifiedPropertiesList" Type="xs:string">Last</w:Option><w:Option Name="__MI_CallbackRegistration" Type="xs:int">11</w:Option><w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">0</w:Option><w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">1</w:Option><w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">2</w:Option><w:Option Name="wmi:__MI_OPERATIONOPTIONS_WRITEERRORMODE" Type="xs:unsignedInt">1</w:Option><w:Option Name="msftwinrm:UsePreciseArrays" Type="xs:boolean">true</w:Option></w:OptionSet></s:Header><s:Body><p0:MSFT_Person xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:p0="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/MSFT_Person" xsi:type="p0:MSFT_Person_Type"><p0:Key xsi:type="cim:cimString">1</p0:Key><p0:Species xsi:nil="true" /><p0:Last xsi:type="cim:cimString">Osama</p0:Last><p0:First xsi:nil="true" /><p0:ExpensiveProperty xsi:nil="true" /></p0:MSFT_Person></s:Body></s:Envelope>
